{"_id":{"$oid":"64b5e4e2f5704c4e6a6e2c44"},"Name":"Harrison Ford","Bio":"is an American actor. He has been a leading man in films of several genres and is regarded as an American cultural icon. His films have grossed more than $5.4 billion in North America and more than $9.3 billion worldwide, making him the seventh-highest-grossing actor in North America. He is the recipient of various accolades, including the AFI Life Achievement Award in 2000, the Cecil B. DeMille Award in 2002, an Honorary César in 2010, and an Honorary Palme d'Or in 2023, in addition to an Academy Award nomination.","Birth":"07-13-1942","Death":"Still Alive"}
{"_id":{"$oid":"64b73ba6f5704c4e6a6e2c45"},"Name":"Charlie Sheen","Bio":"Charlie Sheen, whose real name is Carlos Estevez,  is an American actor. He has appeared in films such as Platoon (1986), Wall Street (1987), Young Guns (1988),The Rookie (1990), The Three Musketeers (1993), and The Arrival (1996). In the 2000s, when Sheen replaced Michael J. Fox as the star of ABC's Spin City, his portrayal of Charlie Crawford earned him a Golden Globe Award for Best Actor. He then starred as Charlie Harper on the CBS sitcom Two and a Half Men (2003–11), for which he received multiple Golden Globe and Primetime Emmy nominations, and as Dr. Charles 'Charlie' Goodson on the FX series Anger Management (2012–14). In 2010, Sheen was the highest-paid actor on television, earning US$1.8 million per episode of Two and a Half Men.","Birth":"09-03-1965","Death":"Still Alive"}
{"_id":{"$oid":"64b74347f5704c4e6a6e2c47"},"Name":"Kurt Russell","Bio":"Kurt Russell is an American actor.He began acting on television at the age of 12 in the western series The Travels of Jaimie McPheeters (1963–1964). In the late 1960s, he signed a ten-year contract with The Walt Disney Company, where he starred as Dexter Riley in films, such as The Computer Wore Tennis Shoes (1969), Now You See Him, Now You Don't (1972), and The Strongest Man in the World (1975). According to Robert Osborne of Turner Classic Movies, Russell became the studio's top star of the 1970s.  Russell was nominated for a Golden Globe Award for Best Supporting Actor – Motion Picture for his performance in Mike Nichols' Silkwood (1983). In the 1980s, he starred in several films directed by John Carpenter, including anti-hero roles such as army hero-turned-robber Snake Plissken in the futuristic action film Escape from New York (1981), its sequel Escape from L.A. (1996), the horror film The Thing (1982), and the kung-fu comedy action film Big Trouble in Little China (1986). For his portrayal of rock and roll superstar Elvis Presley in Elvis (1979), he was nominated for the Primetime Emmy Award for Outstanding Lead Actor in a Limited or Anthology Series or Movie.","Birth":"03-17-1951","Death":"Still Alive"}
{"_id":{"$oid":"64b7477ff5704c4e6a6e2c49"},"Name":"Bill Murray","Bio":"Bill Murray, Born William Murray, is an American actor and comedian. Known for his deadpan delivery in roles ranging from studio comedies to independent dramas.  He has frequently collaborated with directors Ivan Reitman, Harold Ramis, Wes Anderson, Sofia Coppola, and Jim Jarmusch.  He has earned numerous accolades including a BAFTA Award, two Emmy Awards, a Golden Globe Award, and two Independent Spirit Awards, as well as a nomination for an Academy Award.  In 2016, Murray was awarded the Mark Twain Prize for American Humor.","Birth":"09-21-1950","Death":"Still Alive"}
{"_id":{"$oid":"64b85ecef5704c4e6a6e2c4b"},"Name":"Mel Gibson","Bio":"Mel Gibson, is an American actor, film director and producer. He is best known for his action hero roles, particularly his breakout role as Max Rockatansky in the first three films of the post-apocalyptic action series Mad Max and as Martin Riggs in the buddy cop action-comedy film series Lethal Weapon.","Birth":"1956-01-03","Death":"Still Alive"}
{"_id":{"$oid":"64b86af6f5704c4e6a6e2c4d"},"Name":"Bruce Willis","Bio":"Bruce Willis, is an American actor. He achieved fame with a leading role on the comedy-drama series Moonlighting (1985–1989) and appeared in over a hundred films, gaining recognition as an action hero after his portrayal of John McClane in the Die Hard franchise (1988–2013) and other roles.","Birth":"1955-19-03","Death":"Still Alive"}
{"_id":{"$oid":"64b86dd1f5704c4e6a6e2c4f"},"Name":"Corey Feldman","Bio":"Corey Feldman, is an American actor. is an American actor. As a youth, he became well known for roles in the 1980s in films such as Friday the 13th: The Final Chapter (1984), Gremlins (1984), The Goonies (1985), and Stand by Me (1986). In 1987, Feldman co-starred in the horror film The Lost Boys with Corey Haim; they became known as ‘The Two Coreys’ and went on to appear in other films together, including License to Drive (1988) and Dream a Little Dream (1989).","Birth":"1971-07-16","Death":"Still Alive"}
{"_id":{"$oid":"64b873fdf5704c4e6a6e2c52"},"Name":"Michael J. Fox","Bio":"Michael J. Fox, is a retired Canadian actor and activist. Beginning his career in the 1970s, Fox rose to prominence portraying Alex P. Keaton on the NBC sitcom Family Ties (1982–1989) and Marty McFly in the Back to the Future film trilogy (1985–1990). He went on to star in films such as Teen Wolf (1985), The Secret of My Success (1987), Casualties of War (1989), Doc Hollywood (1991), and The Frighteners (1996). Fox returned to television on the ABC sitcom Spin City in the lead role of Mike Flaherty (1996–2000).","Birth":"1961-06-09","Death":"Still Alive"}
{"_id":{"$oid":"64b875c3f5704c4e6a6e2c54"},"Name":"Arnold Schwarzenegger","Bio":"Arnold Schwarzenegger, is an Austrian and American actor, businessman, filmmaker, politician, and retired professional bodybuilder best known for his roles in high-profile action movies.","Birth":"1947-07-30","Death":"Still Alive"}
